---
kind: type
id: T:Autodesk.Revit.DB.Electrical.ElectricalSystemType
source: html/90f62108-9cd1-a66a-a123-8372307f4e7f.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystemType

An enumerated type listing all the possible electrical system types for a connector object.

## Syntax (C#)
```csharp
public enum ElectricalSystemType
```